content_org/post.org
#+AUTHOR: Terrence Ho
#+HUGO_BASE_DIR: ../

** IN-PROGRESS Microsoft Internship                    :microsoft:internship:
   :PROPERTIES:
   :EXPORT_FILE_NAME: microsoft-internship
   :END:
*** How I landed my Microsoft Internship
*** Starting my internship

On July 17th, 2019, I started my Microsoft internship. We registered for I9
employment, and sat through a bunch of presentations Truthfully, they were
terribily boring to me, but it's nice to see that the Microsoft recruiters truly
believe in Microsoft's mission: /Empower every person and organization on this
planet to achieve more./

*** Camp Microsoft

Microsoft has started an intern program called Camp Microsoft, which is a
collection of intern activities and events that help interns get to know one
another and pass the time. You are put in a random group of other interns, led
by two Microsoft employees.

There are trivia nights every Tuesday. Other specific events are organized by
the group leaders.
*** My Project
*** Midpoint
*** Intern Day
*** End of the internshi
