content/post/microsoft-internship.md
+++
title = "Microsoft Internship"
author = ["Terrence Ho"]
tags = ["microsoft", "internship"]
draft = true
+++

## How I landed my Microsoft Internship {#how-i-landed-my-microsoft-internship}


## Starting my internship {#starting-my-internship}

On July 17th, 2019, I started my Microsoft internship. We registered for I9
employment, and sat through a bunch of presentations Truthfully, they were
terribily boring to me, but it's nice to see that the Microsoft recruiters truly
believe in Microsoft's mission: _Empower every person and organization on this
planet to achieve more._


## Camp Microsoft {#camp-microsoft}

Microsoft has started an intern program called Camp Microsoft, which is a
collection of intern activities and events that help interns get to know one
another and pass the time. You are put in a random group of other interns, led
by two Microsoft employees.

There are trivia nights every Tuesday. Other specific events are organized by
the group leaders.


## My Project {#my-project}


## Midpoint {#midpoint}


## Intern Day {#intern-day}


## End of the internship {#end-of-the-internship}
